app/Controllers/Documents.php

INSERT INTO `documents` (`mobile_number`, `file`) VALUES ('9820915802', '1T00727.pdf')
---
    public function create()
    {
        //
        $rules = [
            'mobile_number' => 'required|min_length[10]|max_length[10]',
            'file' => 'uploaded[file]'
        ];

        if (!$this->validate($rules)) {
            return $this->fail($this->validator->getErrors());
        } else {
            try {
                $mobile_number = $this->request->getVar('mobile_number');

                // ? Get the file
                $file = $this->request->getFile('file');
                if (!$file->isValid()) {
                    return $this->fail($file->getErrorString());
                }

                // ? Write to Database
                $doc = [
                    'mobile_number' => $mobile_number,
                    'file' => $file->getName()
                ];

                $documentModel = new Document();
                $documentModel->save($doc);