app/Controllers/Masters.php

SELECT *
FROM `masters`
WHERE `mobile_number` = '9820915802'
INSERT INTO `masters` (`mobile_number`) VALUES ('9820915802')
---
    public function create()
    {
        //
        $rules = [
            'mobile_number' => 'required|min_length[10]|max_length[10]',
        ];

        if (!$this->validate($rules)) {
            return $this->fail($this->validator->getErrors());
        } else {
            try {
                $db = Database::connect();
                $phone =  $this->request->getVar('mobile_number');

                $master = [
                    'mobile_number' => $phone,
                ];

                $masterModel = new Master();
                $m = $db->table("masters")
                        ->where('mobile_number', $phone)
                        ->get()
                        ->getResultObject();
                if (empty($m)) {
                    $masterModel->save($master);