app/Controllers/Users.php

SELECT *
FROM `users`
WHERE `users`.`id` = '7021407127'
---
    public function show($id = null)
    {
        $userModel = new User();
        $user = $userModel->find($id);

INSERT INTO `users` (`mobile_number`, `first_name`, `last_name`) VALUES ('7021407127', 'Hitanshu', 'Panchal')
---
    public function create()
    {
        $rules = [
            'mobile_number' => 'required|min_length[10]|max_length[10]',
            'first_name' => 'required',
            'last_name' =>  'required'
        ];

        if (!$this->validate($rules)) {
            return $this->fail($this->validator->getErrors());
        } else {
            try {
                $user = [
                    'mobile_number' => $this->request->getVar('mobile_number'),
                    'first_name' => $this->request->getVar('first_name'),
                    'last_name' => $this->request->getVar('last_name')
                ];

                $userModel = new User();
                $userModel->save($user);

SELECT *
FROM `users`
WHERE `mobile_number` = '7021407127'
---
    public function getUserByPhone($phone = null)
    {
        $db = Database::connect();
        try {
            $user = $db->table("users")->where('mobile_number', $phone)->get()->getResultObject();